/* automatically generated by rust-bindgen 0.72.1 */

pub const RISCV_ERROR_TYPE_GENERAL_EXCEPTION: i32 = -1;
pub const RISCV_ERROR_TYPE_MACHINE_EXCEPTION: i32 = -2;
pub const RISCV_ERROR_TYPE_MACHINE_TIMEOUT: i32 = -3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RISCVMachine {
    _unused: [u8; 0],
}
pub type riscv_error_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        opaque: *mut ::std::os::raw::c_void,
        type_: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
        data: ::std::os::raw::c_long,
    ),
>;
pub type riscv_stdout_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        opaque: *mut ::std::os::raw::c_void,
        msg: *const ::std::os::raw::c_char,
        size: ::std::os::raw::c_uint,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RISCVOptions {
    pub max_memory: u64,
    pub stack_size: u32,
    pub strict_sandbox: ::std::os::raw::c_int,
    pub argc: ::std::os::raw::c_uint,
    pub argv: *mut *const ::std::os::raw::c_char,
    pub error: riscv_error_func_t,
    pub stdout: riscv_stdout_func_t,
    pub opaque: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RISCVOptions"][::std::mem::size_of::<RISCVOptions>() - 56usize];
    ["Alignment of RISCVOptions"][::std::mem::align_of::<RISCVOptions>() - 8usize];
    ["Offset of field: RISCVOptions::max_memory"]
        [::std::mem::offset_of!(RISCVOptions, max_memory) - 0usize];
    ["Offset of field: RISCVOptions::stack_size"]
        [::std::mem::offset_of!(RISCVOptions, stack_size) - 8usize];
    ["Offset of field: RISCVOptions::strict_sandbox"]
        [::std::mem::offset_of!(RISCVOptions, strict_sandbox) - 12usize];
    ["Offset of field: RISCVOptions::argc"][::std::mem::offset_of!(RISCVOptions, argc) - 16usize];
    ["Offset of field: RISCVOptions::argv"][::std::mem::offset_of!(RISCVOptions, argv) - 24usize];
    ["Offset of field: RISCVOptions::error"][::std::mem::offset_of!(RISCVOptions, error) - 32usize];
    ["Offset of field: RISCVOptions::stdout"]
        [::std::mem::offset_of!(RISCVOptions, stdout) - 40usize];
    ["Offset of field: RISCVOptions::opaque"]
        [::std::mem::offset_of!(RISCVOptions, opaque) - 48usize];
};
unsafe extern "C" {
    pub fn libriscv_set_defaults(options: *mut RISCVOptions);
}
unsafe extern "C" {
    pub fn libriscv_new(
        elf_prog: *const ::std::os::raw::c_void,
        elf_size: ::std::os::raw::c_uint,
        o: *mut RISCVOptions,
    ) -> *mut RISCVMachine;
}
unsafe extern "C" {
    pub fn libriscv_delete(m: *mut RISCVMachine) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn libriscv_run(m: *mut RISCVMachine, instruction_limit: u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn libriscv_allow_file(m: *mut RISCVMachine, path: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn libriscv_strerror(return_value: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn libriscv_return_value(m: *mut RISCVMachine) -> i64;
}
unsafe extern "C" {
    pub fn libriscv_address_of(m: *mut RISCVMachine, name: *const ::std::os::raw::c_char) -> u64;
}
unsafe extern "C" {
    pub fn libriscv_opaque(m: *mut RISCVMachine) -> *mut ::std::os::raw::c_void;
}
#[doc = " View and modify the RISC-V emulator state"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union RISCVFloat {
    pub f32_: [f32; 2usize],
    pub f64_: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RISCVFloat"][::std::mem::size_of::<RISCVFloat>() - 8usize];
    ["Alignment of RISCVFloat"][::std::mem::align_of::<RISCVFloat>() - 8usize];
    ["Offset of field: RISCVFloat::f32_"][::std::mem::offset_of!(RISCVFloat, f32_) - 0usize];
    ["Offset of field: RISCVFloat::f64_"][::std::mem::offset_of!(RISCVFloat, f64_) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RISCVRegisters {
    pub r: [u64; 32usize],
    pub pc: u64,
    pub fcsr: u32,
    pub fr: [RISCVFloat; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RISCVRegisters"][::std::mem::size_of::<RISCVRegisters>() - 528usize];
    ["Alignment of RISCVRegisters"][::std::mem::align_of::<RISCVRegisters>() - 8usize];
    ["Offset of field: RISCVRegisters::r"][::std::mem::offset_of!(RISCVRegisters, r) - 0usize];
    ["Offset of field: RISCVRegisters::pc"][::std::mem::offset_of!(RISCVRegisters, pc) - 256usize];
    ["Offset of field: RISCVRegisters::fcsr"]
        [::std::mem::offset_of!(RISCVRegisters, fcsr) - 264usize];
    ["Offset of field: RISCVRegisters::fr"][::std::mem::offset_of!(RISCVRegisters, fr) - 272usize];
};
unsafe extern "C" {
    pub fn libriscv_get_registers(m: *mut RISCVMachine) -> *mut RISCVRegisters;
}
unsafe extern "C" {
    pub fn libriscv_jump(m: *mut RISCVMachine, address: u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn libriscv_copy_to_guest(
        m: *mut RISCVMachine,
        dst: u64,
        src: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn libriscv_copy_from_guest(
        m: *mut RISCVMachine,
        dst: *mut ::std::os::raw::c_void,
        src: u64,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn libriscv_memstring(
        m: *mut RISCVMachine,
        src: u64,
        maxlen: ::std::os::raw::c_uint,
        length: *mut ::std::os::raw::c_uint,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn libriscv_memview(
        m: *mut RISCVMachine,
        src: u64,
        length: ::std::os::raw::c_uint,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn libriscv_writable_memview(
        m: *mut RISCVMachine,
        src: u64,
        length: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn libriscv_stop(m: *mut RISCVMachine);
}
unsafe extern "C" {
    pub fn libriscv_instruction_counter(m: *mut RISCVMachine) -> u64;
}
unsafe extern "C" {
    pub fn libriscv_max_counter_pointer(m: *mut RISCVMachine) -> *mut u64;
}
#[doc = " RISC-V system call handling"]
pub type riscv_syscall_handler_t =
    ::std::option::Option<unsafe extern "C" fn(m: *mut RISCVMachine)>;
unsafe extern "C" {
    pub fn libriscv_set_syscall_handler(
        num: ::std::os::raw::c_uint,
        arg1: riscv_syscall_handler_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn libriscv_trigger_exception(
        m: *mut RISCVMachine,
        exception: ::std::os::raw::c_uint,
        data: u64,
    );
}
unsafe extern "C" {
    #[doc = " RISC-V VM function calls"]
    pub fn libriscv_setup_vmcall(m: *mut RISCVMachine, address: u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn libriscv_load_binary_file(
        filename: *const ::std::os::raw::c_char,
        data: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
